var local_database = [{
    date: "Sep 18 2016",
    title: "正是虾肥蟹壮时",
    imgSrc: "/images/post/crab.png",
    avatar: "/images/avatar/1.png",
    content: "虾肥蟹壮正当时,此时不吃待何时",
    reading: "112",
    collection: "96",
    headImgSrc: "/images/post/crab.png",
    author: "xxxx",
    dateTime: "12小时前",
    detail: "中华绒螯蟹是一种经济蟹类，又称河蟹、毛蟹、清水蟹、大闸蟹。为中国久负盛名的美食。其螯足用于取食和抗敌，掌部内外缘密生绒毛，绒螯蟹因此而得名。杂食性动物，鱼、虾、螺、蚌、蠕虫、蚯蚓、昆              虫及其幼虫等均可作为大闸蟹的动物性饵料。蟹中含有较多的维生素A，对皮肤的角化有帮助；对儿童的佝偻病，老年人的骨质疏松也能起到补充钙质的作用。中国境内广泛分布于南北沿海各地湖泊，其中以长江水系产量最大，口感极其鲜美。其中又以阳澄湖大闸蟹最为著名，是中国第一个水产类驰名商标、第一个中国国家地理标志产品，被评为“中华绒螯蟹典范品牌”。 其他较为著名的还有太湖大闸蟹、兴化大闸蟹、固城湖大闸蟹、长荡湖大闸蟹等。",
    postId: 0
  },
  {
    date: "Nov 19 2018",
    title: "比利林恩的故事",
    imgSrc: "/images/post/bl.png",
    avatar: "/images/avatar/1.png",
    content: "比利林恩传奇的中场故事",
    reading: "92",
    collection: "80",
    headImgSrc: "/images/post/bl.png",
    author: "美国索尼电影娱乐公司",
    dateTime: "16小时前",
    detail: "《比利·林恩的中场战事》是由美国索尼电影娱乐公司发行，由李安执导，乔·阿尔文、克里斯汀·斯图尔特、克里斯·塔克、加内特·赫德兰联合主演剧情片。《比利·林恩的中场战事》根据本·芳汀同名小说改      编，讲述了在伊拉克战争中的美国士兵比利·林恩与战友战胜归来并被誉为美国英雄，在一场橄榄球公开赛的中场表演过程中，揭露这群士兵在战场上真实经历的故事",
    postId: 1
  },
  {
    date: "Oct 05 2014",
    title: "当我们在谈论经济时，在谈论什么？",
    imgSrc: "/images/post/cat.png",
    avatar: "/images/avatar/3.png",
    content: "没有人不关心经济，经济影响到工作的稳定",
    reading: "133",
    collection: "60",
    headImgSrc: "/images/post/cat.png",
    author: "天涯论坛",
    dateTime: "18小时前",
    detail: "在2016年的春节，大家都忙着回家团聚、吃年夜饭、除夕放烟花的时间里，但是今年除了平常的年夜饭之外，我们也看了一场热闹。这个事件是因为“上海女孩见第一顿饭就分手”，以及媒体与公众对这一事件的讨论和热议。大致情况是上海女孩跟男友（江西人）回江西老家过年，男友家里准备的年夜饭（昏暗的灯光、简陋的餐桌），将如下这张图片发到上海本地的论坛求助，在舆论助波下，上海女决定第二天就乘飞机会上海。大年初一，该事件占据了互联网主要的传播渠道，而以刷屏朋友圈为盛。媒体及舆论给他们贴上了社会上熟悉的标签，上海女孩被称为孔雀女，江西男孩被称为凤凰男，随之衍生出来的教养问题、农村与城市的差距、乡村的现状讨论。",
    postId: 2
  },
  {
    date: "Dec 28 2019",
    title: "微应用开发",
    imgSrc: "/images/post/xiaolong.jpg",
    avatar: "/images/avatar/3.png",
    content: "微应用主要特点是免安装、体积小、速度快，即用即走",
    reading: "42",
    collection: "123",
    headImgSrc: "/images/post/xiaolong.jpg",
    author: "信海光",
    dateTime: "20小时前",
    detail: "刚刚出现的是我打游戏的画面，被大家看到了，那个不是我最好的水平，因为有点紧张，我最高分曾打到6000多分。当然我是练习了很久了，并不是我比大家更厉害，而是我有很多时间去练习，这个游戏我觉得挺好玩，我自己在游戏里面获得了一个称号，叫“无聊大师”，像上个星期我打了到6000分，我发现我获得了一个称号叫“立地成佛”，一不小心变成了佛系。玩这个游戏的时候，因为我们在朋友的排行榜可以看到，所以很多朋友会问我，你这个分数是自己打出来的吗？是不是一个外挂或者直接修改后面的数据库得来的分数，但这个引发了我挺多思考。跳一跳这个游戏其实我们只是把它当成一个Demo来做，其实是微信新版本里为了体现微信的小程序、小游戏这样一个平台的威力，所以我们其实是很匆忙做了一款特别简单的游戏。",
    postId: 3
  },
  {
    date: "June 30 2019",
    title: "这几天,闲来无事，在学习微信小程序开发",
    imgSrc: "/images/post/sls.jpg",
    avatar: "/images/avatar/3.png",
    content: "近几年来，微信小程序逐渐流行开来",
    reading: "120",
    collection: "43",
    headImgSrc: "/images/post/sls.jpg",
    author: "微信爱好者",
    dateTime: "24小时前",
    detail: "当时的我，正值大二，小菜鸟一枚。不知道什么是前端，什么是后端，更别提服务器了，所掌握的不过仅仅是常规的课堂知识。没有做过实际的项目，只会用Java写一个Hello World。心里其实是想去学一些东西，但却往往是没有方向，不知道从何下手。于是乎我便自己摸索，大二的寒假，我抽时间将数据库方面的知识提前学习了一下，并在大二下学期的课程设计中运用，这应该算是我第一次实际的项目经历了。大二下学期是我学东西学得最多的一个学期，除了上课或者带训，其他时间我几乎都在学习专业知识。HTML，JavaScript，CSS，Android，JSP等等。",
    postId: 4
  },
  {
    date: "Nov 21 2018",
    title: "科学家发现外星生命体啦",
    imgSrc: "/images/post/vr.png",
    avatar: "/images/avatar/5.png",
    content: "对于科学家发现外星生命体这件事，刘慈欣建议不要回答",
    reading: "150",
    collection: "75",
    headImgSrc: "/images/post/sls.jpg",
    author: "天文爱好者",
    dateTime: "24小时前",
    detail: "天文学家已经在太阳系“附近”新发现15颗围绕一颗小型红矮星运转的行星。在这些新发现的行星中，一颗可能宜居的“超级地球”存在液态海洋。编号为“K2-155d”的这颗行星大小是地球1.6倍，位于其宿主恒星的宜居带内。这些行星是由东京工业大学地球与行星科学系的Hiroyuki Hirano领导的研究小组发现的。很长一段时间以来，科学家们不在红矮星周围搜索外星生命，因为它们的宜居带很小。围绕红矮星运转的行星距离它们非常近，一侧一直对着红矮星，温度非常高，另一侧则黑暗而寒冷。根据来自美国航空航天局开普勒太空望远镜第二个任务K2的数据显示，这些红矮星可能对研究行星形成和演化的研究人员非常有用。研究人员表示，根据气候模拟的结果，新发现的类地行星K2-155d地表可能存在液态水。 在能够更准确地计算出恒星的大小和温度前，科学家们无法确定这一行星是否宜居。 研究人员表示，他们需要进一步研究才能确定它是否宜居。",
    postId: 5
  }
]

module.exports = {
  postList: local_database
}